#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//只适用于整数
// & - 按（二进制）位与
// | - 按（二进制）位或
// ^ - 按（二进制）位异或

int main()
{
	int a = 3;
	int b = -5;
	int c = a & b;
	//0000000000000000000000000000011 - 3的补码
	//1000000000000000000000000000101 - -5的原码
	//1111111111111111111111111111010 - -5的反码
	//1111111111111111111111111111011 - -5的补码

	int d = a | b;
	int e = a ^ b;
	printf("c=%d\n", c);//3
	printf("d=%d\n", d);//-5
	printf("e=%d\n", e);//-8

	// 3^3 = 0 -> a^a=0
	// 0^5 = 5 -> 0^a=a
	// 
	//3^3^5 = 5
	//3^5^3 = 5
	//异或支持交换律

	int num1 = 3;
	int num2 = 5;
	num1 = num1 ^ num2;//num1=3^5
	num2 = num1 ^ num2;//num2=3^5^5=3
	num1 = num1 ^ num2;//num1=3^5^3=5

	return 0;

}
//编写代码实现：求一个整数存储在内存中的二进制中1的个数
//即求补码的二进制中1的个数